HengYongChao/Light-Switch/examples/nRF51-ble-bcast-mesh-0.8.7/nRF51/examples/BLE_Gateway/main.c
/***********************************************************************************
Copyright (c) Nordic Semiconductor ASA
All rights reserved.

Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

  1. Redistributions of source code must retain the above copyright notice, this
  list of conditions and the following disclaimer.

  2. Redistributions in binary form must reproduce the above copyright notice, this
  list of conditions and the following disclaimer in the documentation and/or
  other materials provided with the distribution.

  3. Neither the name of Nordic Semiconductor ASA nor the names of other
  contributors to this software may be used to endorse or promote products
  derived from this software without specific prior written permission.

THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
(INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
************************************************************************************/

#include "rbc_mesh.h"
#ifdef MESH_DFU
#include "dfu_app.h"
#endif
#ifdef BLINKY
#include "blinky.h"
#endif

#include "nrf_adv_conn.h"
#include "led_config.h"
#include "mesh_aci.h"

#include "softdevice_handler.h"
#include "app_error.h"
#include "nrf_gpio.h"
#include "boards.h"

#if NORDIC_SDK_VERSION >= 11
#include "nrf_nvic.h"
#endif

#include <stdbool.h>
#include <stdint.h>
#include <string.h>
#include <stdio.h>

#include "app_timer.h"
#include "bsp.h"
#include "nrf_drv_config.h"
#if DEBUG_LOG_RTT
#include "SEGGER_RTT.h"
#endif
#include "nrf_delay.h"
#include "app_pwm.h"
#include "nrf_error.h"
#include "nrf_adc.h"
#include "nrf_wdt.h"
#include "nrf_drv_wdt.h"
#include "app_util_platform.h"

#define MESH_ACCESS_ADDR        (RBC_MESH_ACCESS_ADDRESS_BLE_ADV)   /**< Access address for the mesh to operate on. */
#define MESH_INTERVAL_MIN_MS    (100)                               /**< Mesh minimum advertisement interval in milliseconds. */
#define MESH_CHANNEL            (38)                                /**< BLE channel to operate on. Single channel only. */
#define APP_TIMER_PRESCALER        0                                /**< Value of the RTC1 PRESCALER register. */
#define APP_TIMER_MAX_TIMERS       (20 + BSP_APP_TIMERS_NUMBER)      	/**< Maximum number of simultaneously created timers. */
#define APP_TIMER_OP_QUEUE_SIZE    4                                /**< Size of timer operation queues. */

#define HEARTBEAT_INTERVAL      APP_TIMER_TICKS(130, APP_TIMER_PRESCALER) 	/**< led1 heartbeat interval (ticks). */
#define RELAY_INTERVAL      	APP_TIMER_TICKS(90, APP_TIMER_PRESCALER) 	/**< RELAY interval (ticks). */
#define COMMUNICATE_INTERVAL    APP_TIMER_TICKS(50, APP_TIMER_PRESCALER) 	/**< communicate led interval (ticks). */
#define MOTION_SOUND_INTERVAL   APP_TIMER_TICKS(3760, APP_TIMER_PRESCALER) 	/**< SOUND&MOTION led interval (ticks). */
/* a man breath rates 16-20 per minute, T = 3s - 3.75s, step length 40, so interval 75-93 */
#define PWM_UPDATE_INTERVAL     APP_TIMER_TICKS(85, APP_TIMER_PRESCALER) 	
#define PIR_MES_INTERVAL    	APP_TIMER_TICKS(180, APP_TIMER_PRESCALER) 	/**< sound measure interval (ticks). */
#define SOUND_MES_INTERVAL    	APP_TIMER_TICKS(12, APP_TIMER_PRESCALER) 	/**< sound measure interval (ticks). */
#define LIGHT_MES_INTERVAL    	APP_TIMER_TICKS(540, APP_TIMER_PRESCALER) 	/**< light sonsor measure interval (ticks). */
#define TEMP_MES_INTERVAL    	APP_TIMER_TICKS(620, APP_TIMER_PRESCALER) 	/**< temperature measure interval (ticks). */
#define WATCHDOG_INTERVAL    	APP_TIMER_TICKS(1005, APP_TIMER_PRESCALER) 	/**< watchdog interval (ticks). */
#define KEY_PERIOD_HANG_SENSOR	APP_TIMER_TICKS(3009, APP_TIMER_PRESCALER)  /**< detect key hang motion and sound interval (ticks). */

static app_timer_id_t           m_heartbeat_timer_id;              /**< heartbeat timer. */
#ifdef RELAY_LATCH
static app_timer_id_t           m_relay_timer_id;                  /**< relay execute timer. */
#endif
static app_timer_id_t           m_communicate_timer_id;            /**< led communicate timer. */
static app_timer_id_t           m_motion_sound_timer_id;           /**< motion and sound event timer. */
static app_timer_id_t           m_pwm_update_timer_id;             /**< PWM update timer. */
static app_timer_id_t           m_pir_mes_timer_id;                /**< PIR measure timer. */
static app_timer_id_t           m_sound_mes_timer_id;              /**< sound measure timer. */
static app_timer_id_t           m_light_mes_timer_id;              /**< light sensor measure timer. */
static app_timer_id_t           m_temp_mes_timer_id;               /**< temperature measure timer. */
static app_timer_id_t           m_watchdog_timer_id;               /**< watchdog timer. */
static app_timer_id_t           m_hang_on_timer_id;                /**< hang on sound & pir timer. */


static volatile bool ready_flag;            // A flag indicating PWM status.
volatile int32_t adc_sample[4];
volatile int32_t PIR_Buffer[2];
volatile int32_t sound_sample = 0;
volatile int32_t light_sample = 0;
volatile int32_t temp_sample = 0;
volatile int16_t temp_centigrade;
volatile int16_t temp_fahrenheit; 
volatile int16_t calibration_temperature = 0;

led_event_t			 led_event;
pwm_enevt_t			 pwm_event;
uint8_t 			 relay_status = 0;
nrf_drv_wdt_channel_id m_channel_id;		//wdt
void update_led_event(led_event_e led_event_type);


uint16_t const ntc_table_10K[20] =	
{
	25,	39,	61,	83,	102, 113, 112, 101,	85,
	67,	51,	38,	28,	21,	15,	11,	8, 6, 5, 19
};


APP_PWM_INSTANCE(PWM1,1);                   // Create the instance "PWM1" using TIMER1.


#if NORDIC_SDK_VERSION >= 11
nrf_nvic_state_t nrf_nvic_state = {0};
static nrf_clock_lf_cfg_t m_clock_cfg = 
{
    .source = NRF_CLOCK_LF_SRC_XTAL,    
    .xtal_accuracy = NRF_CLOCK_LF_XTAL_ACCURACY_75_PPM
};

#define MESH_CLOCK_SOURCE       (m_clock_cfg)    /**< Clock source used by the Softdevice. For calibrating timeslot time. */
#else
#define MESH_CLOCK_SOURCE       (NRF_CLOCK_LFCLKSRC_XTAL_75_PPM)    /**< Clock source used by the Softdevice. For calibrating timeslot time. */
#endif

