HengYongChao/Light-Switch/examples/nRF51-ble-bcast-mesh-0.8.7/nRF51/examples/BLE_Gateway/main.c
}

/**@brief Function for handling the led blink timer timeout.
 *
 * @details This function will be called each time the led blink timer expires.
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the timeout handler.
 */
static void led_heartbeat_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);		
		
	if((led_event.event_type == SOUND_EVENT) || (led_event.event_type == MOTION_EVENT))
	{

	}else if(led_event.event_type == COMMUNICATE_EVENT)
	{
		
	}else if(led_event.event_type == HEARTBEAT_EVENT)
	{
		if(led_event.status)
		{
			if(!led_event.on_time--)
			{					
				nrf_gpio_pin_set(BSP_LED_1);
				led_event.status = false;
				led_event.off_time = (uint16_t)HEARTBEAT_EVENT_OFF; 
				led_event.on_time = (uint16_t)HEARTBEAT_EVENT_ON; 
			}			
		}else
		{
			if(!led_event.off_time--)
			{			
				nrf_gpio_pin_clear(BSP_LED_1);
				led_event.status = true;
				led_event.on_time = (uint16_t)HEARTBEAT_EVENT_ON;
				led_event.off_time = (uint16_t)HEARTBEAT_EVENT_OFF; 		
			}			
		}		
	}else if(led_event.event_type == FIRMWAREUPDATE_EVENT)
	{
		
	}else
	{
		
	}
		
}
/**@brief Function for handling the watchdog timer timeout.
 *
 * @details This function will be called each time the watchdog timer expires.
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the timeout handler.
 */
static void watch_dog_handler(void * p_context)
{
	UNUSED_PARAMETER(p_context);	
	nrf_drv_wdt_channel_feed(m_channel_id);	//feed the dog
}


/**@brief Function for handling the relay execute timer timeout.
 *
 * @details This function will be called each time relay execute timer expires.
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the timeout handler.
 */
#ifdef RELAY_LATCH
static void relay_execute_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);		
    relay_idle();		
}
#endif
/**@brief Function for handling the led stay timer timeout.
 *
 * @details This function will be called each led stay execute timer expires.
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the timeout handler.
 */
static void led_off_handler(void * p_context)
{
    uint32_t err_code;
	
	UNUSED_PARAMETER(p_context);		
    nrf_gpio_pin_set(BSP_LED_1);	
	//update_led_event(HEARTBEAT_EVENT);
	
	led_event.status = false;
	led_event.event_type = HEARTBEAT_EVENT;
	led_event.off_time = HEARTBEAT_EVENT_OFF - 40;			//queick start blink ASAP.
	led_event.on_time = HEARTBEAT_EVENT_ON;		
	
    err_code = app_timer_start(m_pir_mes_timer_id, PIR_MES_INTERVAL, NULL);				
    APP_ERROR_CHECK(err_code);	
    err_code = app_timer_start(m_sound_mes_timer_id, SOUND_MES_INTERVAL, NULL);			
    APP_ERROR_CHECK(err_code);	
}
/**@brief Function for handling the led communicate timer timeout.
 *
 * @details This function will be called each led communicate execute timer expires.
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the timeout handler.
 */
static void blink_off_handler(void * p_context)
{	
	UNUSED_PARAMETER(p_context);		
    nrf_gpio_pin_set(BSP_LED_1);	
	update_led_event(HEARTBEAT_EVENT);			
}

/**@brief Function for handling the pir&sound hang on timer timeout.
 *
 * @details This function will be called each led pir&sound hang on execute timer expires.
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the timeout handler.
 */
static void hang_on_handler(void * p_context)
{	
	
	UNUSED_PARAMETER(p_context);		

	open_pir_sound_timer();
	
}

/**@brief Function for handling the pwm update timer timeout.
 *
 * @details This function will be called each pem update timer expires.
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the timeout handler.
 */
static void pwm_update_handler(void * p_context)
{
    uint32_t		err_code;
	uint32_t		value ;	
	pwm_enevt_t	*	p_pe;     
	
	p_pe = (pwm_enevt_t*) p_context;
	p_pe->loop++;		

	if(p_pe->loop <= 40)
	{						
				
		//if(p_pe->tendency)
		if(relay_status)
		{									
			value = (p_pe->loop < 20) ? (100 - p_pe->loop * 5) : (p_pe->loop * 5 - 100);	/*¡ü ¡ý*/	
		}else
		{			
			value = (p_pe->loop < 20) ? (p_pe->loop * 5) : (100 - (p_pe->loop - 20) * 5);	/*¡ý ¡ü*/
		}
					
		ready_flag = false;
		/* Set the duty cycle - keep trying until PWM is ready... */
		while (app_pwm_channel_duty_set(&PWM1, 0, value) == NRF_ERROR_BUSY);
		;
		while (app_pwm_channel_duty_set(&PWM1, 1, value) == NRF_ERROR_BUSY);
		;
		/* ... or wait for callback. */
		//while(!ready_flag);
		//APP_ERROR_CHECK(app_pwm_channel_duty_set(&PWM1, 1, value));

//#ifdef DEBUG_LOG_RTT
//		SEGGER_RTT_printf(0, "pwm_update %d,%d.\r\n",(uint8_t)p_pe->loop,(uint16_t)value);
//#endif					
		
	}else
	{
		err_code = app_timer_stop(m_pwm_update_timer_id);
		APP_ERROR_CHECK(err_code);	

		
	}	
		
}

/**@brief Function for handling the PIR update timer timeout.
 *
 * @details This function will be called each PIR update timer expires.
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the timeout handler.
 */
static void pir_event_handler(void * p_context)
{
//	uint32_t err_code;
	
	UNUSED_PARAMETER(p_context);	
	//PIR_Buffer[0] = PIR_Buffer[1];
	
	PIR_Buffer[1] = nrf_adc_convert_single(NRF_ADC_CONFIG_INPUT_4);	
	
	if(PIR_Buffer[1] < 200) 
	{
		update_led_event(MOTION_EVENT);
		motion_sound_event_set(MOTION_EVENT);
				
#ifdef DEBUG_LOG_RTT
		SEGGER_RTT_printf(0, "MOTION_EVENT %2d\r\n",(uint16_t)PIR_Buffer[1]);															
#endif	

		shut_pir_sound_timer();
		
