HengYongChao/Light-Switch/examples/nRF51-ble-bcast-mesh-0.8.7/nRF51/examples/BLE_Gateway/main.c
        case BSP_EVENT_KEY_1:		
		if(relay_status)
		{
			
			relay_status = 0;			
			update_pwm_value(0x00);
			shut_pir_sound_timer();		
			err_code = app_timer_start(m_hang_on_timer_id, KEY_PERIOD_HANG_SENSOR, NULL);			
			APP_ERROR_CHECK(err_code);	

			#ifdef RELAY_LATCH	
			relay_off();
			err_code = app_timer_start(m_relay_timer_id, RELAY_INTERVAL, NULL);
			APP_ERROR_CHECK(err_code);	
			#else
			relay_off();
			#endif
			

			#ifdef DEBUG_LOG_RTT
			SEGGER_RTT_printf(0, "relay_off.\r\n");	
			#endif			
		}else
		{
			
			relay_status = 1;
			update_pwm_value(100);	
			#ifdef RELAY_LATCH
			relay_on();
			err_code = app_timer_start(m_relay_timer_id, RELAY_INTERVAL, NULL);
			APP_ERROR_CHECK(err_code);
			#else
			relay_on();
			#endif
			shut_pir_sound_timer();	
			err_code = app_timer_start(m_hang_on_timer_id, KEY_PERIOD_HANG_SENSOR, NULL);			
			APP_ERROR_CHECK(err_code);
			
			#ifdef DEBUG_LOG_RTT
			SEGGER_RTT_printf(0, "relay_on.\r\n");
			#endif
		}		
        break;
        case BSP_EVENT_KEY_2:
				
        break;
        case BSP_EVENT_KEY_3:
				
        break;
        default:
            break;
    }
}

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
static void timers_init(void)
{
    uint32_t err_code;

	/* The timer library enables the application to create multiple timer instances based on the RTC1 peripheral. 
		Checking for time-outs and invoking the user time-out handlers is performed in the RTC1 interrupt handler. 
		List handling is done using a software interrupt (SWI0). Both interrupt handlers are running in APP_LOW priority level. */	
    // Initialize timer module.
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_MAX_TIMERS, APP_TIMER_OP_QUEUE_SIZE, false);
		
    // Create timers.
    err_code = app_timer_create(&m_heartbeat_timer_id, APP_TIMER_MODE_REPEATED, led_heartbeat_handler);                                                                
    APP_ERROR_CHECK(err_code);
	// Create relay execute timer.
	#ifdef RELAY_LATCH
    err_code = app_timer_create(&m_relay_timer_id, APP_TIMER_MODE_SINGLE_SHOT, relay_execute_handler);                                                                
    APP_ERROR_CHECK(err_code);	
	#endif
	
    err_code = app_timer_create(&m_communicate_timer_id, APP_TIMER_MODE_SINGLE_SHOT, blink_off_handler);                                                                
    APP_ERROR_CHECK(err_code);	

    err_code = app_timer_create(&m_pwm_update_timer_id, APP_TIMER_MODE_REPEATED, pwm_update_handler);                                                                
    APP_ERROR_CHECK(err_code);
	
    err_code = app_timer_create(&m_motion_sound_timer_id, APP_TIMER_MODE_SINGLE_SHOT, led_off_handler);                                                                
    APP_ERROR_CHECK(err_code);	
	
    err_code = app_timer_create(&m_pir_mes_timer_id, APP_TIMER_MODE_REPEATED, pir_event_handler);                                                                
    APP_ERROR_CHECK(err_code);	
	
    err_code = app_timer_create(&m_sound_mes_timer_id, APP_TIMER_MODE_REPEATED, sound_event_handler);                                                                
    APP_ERROR_CHECK(err_code);		
		
    err_code = app_timer_create(&m_light_mes_timer_id, APP_TIMER_MODE_REPEATED, light_event_handler);                                                                
    APP_ERROR_CHECK(err_code);		
	
    err_code = app_timer_create(&m_temp_mes_timer_id, APP_TIMER_MODE_REPEATED, temperature_event_handler);                                                                
    APP_ERROR_CHECK(err_code);		
	
    err_code = app_timer_create(&m_watchdog_timer_id, APP_TIMER_MODE_REPEATED, watch_dog_handler);                                                                
    APP_ERROR_CHECK(err_code);	

    err_code = app_timer_create(&m_hang_on_timer_id, APP_TIMER_MODE_SINGLE_SHOT, hang_on_handler);                                                                
    APP_ERROR_CHECK(err_code);	
	
}
/**@brief Function for starting application timers.
 */
static void application_timers_start(void)
{
    uint32_t err_code;

    // Start application timers.
    err_code = app_timer_start(m_sound_mes_timer_id, SOUND_MES_INTERVAL, NULL);			//12ms
    APP_ERROR_CHECK(err_code);		
	
    err_code = app_timer_start(m_watchdog_timer_id, WATCHDOG_INTERVAL, NULL);			//1000ms
    APP_ERROR_CHECK(err_code);
	
    err_code = app_timer_start(m_heartbeat_timer_id, HEARTBEAT_INTERVAL, NULL);		//100ms
    APP_ERROR_CHECK(err_code);
		
    err_code = app_timer_start(m_pir_mes_timer_id, PIR_MES_INTERVAL, NULL);				//200ms
    APP_ERROR_CHECK(err_code);		
	
    err_code = app_timer_start(m_light_mes_timer_id, LIGHT_MES_INTERVAL, NULL);			//500ms
    APP_ERROR_CHECK(err_code);	
	
    err_code = app_timer_start(m_temp_mes_timer_id, TEMP_MES_INTERVAL, NULL);			//600ms
    APP_ERROR_CHECK(err_code);
	
}
/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(void)
{
    uint32_t err_code = bsp_init(/*BSP_INIT_LED |*/ BSP_INIT_BUTTONS,
                                 APP_TIMER_TICKS(100, APP_TIMER_PRESCALER), 
                                 bsp_event_handler);
    APP_ERROR_CHECK(err_code);

}

void bsp_pwm_init(void)
{
    ret_code_t err_code;
    
    /* 2-channel PWM, 200Hz, output on DK LED pins. */
    app_pwm_config_t pwm1_cfg = APP_PWM_DEFAULT_CONFIG_2CH(5000L, BSP_LED_0, BSP_LED_2);
    
    /* Switch the polarity of the second channel. */
	pwm1_cfg.pin_polarity[0] = APP_PWM_POLARITY_ACTIVE_HIGH;
    pwm1_cfg.pin_polarity[1] = APP_PWM_POLARITY_ACTIVE_HIGH;	//APP_PWM_POLARITY_ACTIVE_HIGH
    	
    /* Initialize and enable PWM. */
    err_code = app_pwm_init(&PWM1,&pwm1_cfg,NULL);	//pwm_ready_callback
    APP_ERROR_CHECK(err_code);
		
