HengYongChao/Light-Switch/examples/nRF51-ble-bcast-mesh-0.8.7/nRF51/examples/BLE_Gateway/main.c
    app_pwm_enable(&PWM1);	
	
	while (app_pwm_channel_duty_set(&PWM1, 0, 100) == NRF_ERROR_BUSY);	
	while (app_pwm_channel_duty_set(&PWM1, 1, 100) == NRF_ERROR_BUSY);
}

void bsp_wdt_init(void)
{
	uint32_t err_code = NRF_SUCCESS;
	
    //Configure WDT.
	nrf_drv_wdt_config_t config = NRF_DRV_WDT_DEAFULT_CONFIG;
    err_code = nrf_drv_wdt_init(&config, wdt_event_handler);
    APP_ERROR_CHECK(err_code);
    err_code = nrf_drv_wdt_channel_alloc(&m_channel_id);
    APP_ERROR_CHECK(err_code);
    nrf_drv_wdt_enable();	
}

/**@brief Function for initializing services that will be used by the application.
 *
 * @details Initialize the Heart Rate, Battery and Device Information services.
 */
//static void services_init(void)
//{
//}

/** @brief main function */
int main(void)
{
    /* init leds and pins */
    gpio_init();
	/* power on led light on for a while */
	leds_on_for_while();
    /* Initialize timer module.*/
    timers_init();
	/* Initialize button and leds.*/
	buttons_leds_init();
	/* Initialize pwm.*/
	bsp_pwm_init();
	/* Initialize adc config.*/
	adc_config();
	/* Initialize wdt modle */
	bsp_wdt_init();
	
#ifdef DEBUG_LOG_RTT	// RTT debug interface.
	SEGGER_RTT_ConfigUpBuffer(0, NULL, NULL, 0, SEGGER_RTT_MODE_BLOCK_IF_FIFO_FULL);
	SEGGER_RTT_printf(0, "SEGGER_RTT init ok.\r\n");
#endif	
	
    /* Enable Softdevice (including sd_ble before framework */
#ifdef NRF52
    SOFTDEVICE_HANDLER_INIT(&MESH_CLOCK_SOURCE,NULL); 
#else
    SOFTDEVICE_HANDLER_INIT(MESH_CLOCK_SOURCE,NULL); 
#endif    

    softdevice_ble_evt_handler_set(sd_ble_evt_handler); 
	/* app-defined event handler, as we need to send it to the nrf_adv_conn module and the rbc_mesh */
    softdevice_sys_evt_handler_set(rbc_mesh_sd_evt_handler);

#ifdef RBC_MESH_SERIAL
    mesh_aci_init();
#endif   
       
    rbc_mesh_init_params_t init_params;

    init_params.access_addr = MESH_ACCESS_ADDR;
    init_params.interval_min_ms = MESH_INTERVAL_MIN_MS;
    init_params.channel = MESH_CHANNEL;
    init_params.lfclksrc = MESH_CLOCK_SOURCE;
    init_params.tx_power = RBC_MESH_TXPOWER_0dBm ;
    
    uint32_t error_code = rbc_mesh_init(init_params);
    APP_ERROR_CHECK(error_code);

    /* request values for both LEDs on the mesh */
    for (uint32_t i = 0; i < 2; ++i)
    {
        error_code = rbc_mesh_value_enable(i);
        APP_ERROR_CHECK(error_code);
    }
    /* init BLE gateway softdevice application: */
    nrf_adv_conn_init();
    
#ifdef RBC_MESH_SERIAL
    APP_ERROR_CHECK(mesh_aci_start());
#endif
    
#ifdef BLINKY   
    led_init ();
    rtc_1_init ();
    start_blink_interval_s(1);    
#endif  
		
    app_button_enable();
//	app_pwm_enable(&PWM1);
	application_timers_start();	
	motion_sound_event_set(HEARTBEAT_EVENT);
	
    rbc_mesh_event_t evt;
    while (true)
    {
#ifdef BUTTONS
        for (uint32_t pin = BUTTON_START; pin <= BUTTON_STOP; ++pin)
        {
            if(nrf_gpio_pin_read(pin) == 0)
            {
                while(nrf_gpio_pin_read(pin) == 0);
                uint8_t mesh_data[1];
                uint32_t led_status = !!((pin - BUTTON_START) & 0x01); /* even buttons are OFF, odd buttons are ON */
                uint32_t led_offset = !!((pin - BUTTON_START) & 0x02); /* two buttons per led */

                mesh_data[0] = led_status;
                if (rbc_mesh_value_set(led_offset, mesh_data, 1) == NRF_SUCCESS)
                {
                    led_config(led_offset, led_status);
                }
            }
        }
#endif       
        if (rbc_mesh_event_get(&evt) == NRF_SUCCESS)
        {   
            rbc_mesh_event_handler(&evt);
            rbc_mesh_event_release(&evt);						
        }						
		sd_app_evt_wait();
    }
}

